{
  "profile.name": "Dániel Kovács",
  "profile.dateOfBirth.key": "Date of birth",
  "profile.nationality.key": "Nationality",
  "profile.location.key": "Location",
  "profile.mobileNumber.key": "Mobile number",
  "profile.emailAddress.key": "E-mail address",
  "profile.dateOfBirth.value": "1995.09.09",
  "profile.nationality.value": "Hungarian",
  "profile.location.value": "Budapest, XVI.",
  "profile.mobileNumber.value": "+36 70 510 8334",
  "profile.emailAddress.value": "kovacs.daniel.9509@gmail.com",
  "work.sectionTitle": "Work experiences",
  "work.nokia": "Nokia Solutions and Networks Kft.",
  "work.nokiaWebGUIDev.title": "Web GUI Developer",
  "work.nokiaWebGUIDev.caption": "Working on multiple Single Page Applications which are ment for creating / maintaining an environment for business application's tests.",
  "work.nokiaSWSpecialist.title": "Software Specialist",
  "work.nokiaSWSpecialist.caption": "Developing a business web application which is based on Python DjangoREST framework with React frontend, that is capable of handling and validating YANG based configurations. We were using a multi-container setup for the application deployment, first there was Docker Compose in OpenStack environment, then we switched to Kubernetes.",
  "work.nokiaVerificationSpecialist.title": "Software Verification Specialist",
  "work.nokiaVerificationSpecialist.caption": "Developing and maintaining several web based applications for the System Verification team who was responsible for testing and validating many products of ours, with the main focus on automation.",
  "work.nokiaDevOpsEngineer.title": "DevOps Engineer",
  "work.nokiaDevOpsEngineer.caption": "Integrating a flexible monitoring system to our existing product, which was capable of monitoring baremetal and networking components. Besides that I developed many security related improvements.",
  "work.nokiaSWDeveloperIntern.title": "Software Developer Intern",
  "work.nokiaSWDeveloperIntern.caption": "Developing a Django and YANG based configuration web application for internal product.",
  "work.cadline": "Cadline Kft.",
  "work.cadlineSWDeveloperIntern.title": "Software Developer Intern",
  "work.cadlineSWDeveloperIntern.caption": "Developing a new feature to the Archline.XP software, which was capable to cover up surfaces with uneven rectangles.",
  "skills.sectionTitle": "Work skills",
  "skills.python.description": "I have used many web frameworks, but I have the most experience in Django, including DjangoREST, but for smaller projects I used Flask or AIOHTTP. I planned/developed an internal tool which has almost a 1000 people per month visit, from all around the world. Besides that I have some experience with evaluating large xml files, YANG structures and implementing asynchronous tasks.",
  "skills.js.description": "I have worked with many popular frontend frameworks, I have (ca. half year) experience with Angular, but most of my time I worked with React (ca. 2 year). I wrote my thesis in full stack JavaScript (Node.js - React).",
  "skills.linux.description": "I'm using Linux in work and at home. I have experience with Linux based server hosting and maintaining.",
  "skills.docker.description": " ",
  "skills.kubernetes.description": " ",
  "school.sectionTitle": "Schools",
  "school.gdf.name": "BSc in Computer Science Engineering, Denis Gabor College (distance education), Budapest (Hungary)",
  "school.itk.name": "Pázmány Péter Catholic University - Faculty of Information Technology and Bionics, Budapest (Hungary)",
  "school.wattay.name": "Wattay High School and Vocational School, Kiskőrös (Hungary)",
  "school.petofi.name": "Kiskőrösi Petőfi Sándor High School, Kiskőrös (Hungary)",
  "lang.sectionTitle": "Language",
  "lang.hungarian": "Hungarian",
  "lang.hungarian.levelDescription": "nativ",
  "lang.english": "English",
  "lang.english.levelDescription": "conversational level, jargon",
  "hobby.sectionTitle": "Hobby, free time",
  "hobby.programing.title": "programing",
  "hobby.programing.description": "I like to work on smaller projects in my free time, for example smaller 3d games or custom, interesting webpages",
  "hobby.cycling.title": "riding, building and repairing bicycles",
  "hobby.cycling.description": "I'm commuting with bike in the city, but I like riding longer distances too, I also repaired and maintained several bikes"
}