{
    "profile.name": "Kovács Dániel",

    "profile.dateOfBirth.key": "Születési dátum",
    "profile.nationality.key": "Állampolgárság",
    "profile.location.key": "Tartózkodási hely",
    "profile.mobileNumber.key": "Telefon szám",
    "profile.emailAddress.key": "E-mail cím",
    "profile.dateOfBirth.value": "1995.09.09",
    "profile.nationality.value": "magyar",
    "profile.location.value": "Budapest, XVI. kerület",
    "profile.mobileNumber.value": "+36 70 510 8334",
    "profile.emailAddress.value": "kovacs.daniel.9509@gmail.com",

    "work.sectionTitle": "Szakmai tapasztalatok",
    "work.nokia": "Nokia Solutions and Networks Kft.",
    "work.nokiaSWSpecialist.title": "Software Specialista",
    "work.nokiaSWSpecialist.caption": "Python DjangoREST alapú webes alkalmazás fejlesztése, React klienssel ami YANG alapú adatszerkezeteket kezel és validál. Több konténeres struktúrával készült, amit eleinte Docker Compose-al OpenStack-be, majd Kubernetes-szel saját Cloudok-ba szállítottunk a vevőkhöz.",
    "work.nokiaVerificationSpecialist.title": "Software Verification Specialista",
    "work.nokiaVerificationSpecialist.caption": "Python webes alkalmazások fejlesztését, karbantartását végeztem a System Verification csapat számára akik tesztelték és igazolták a nagyobb termékeinek helyes működését, a fő cél az automatizálás volt.",
    "work.nokiaDevOpsEngineer.title": "DevOps Mérnök",
    "work.nokiaDevOpsEngineer.caption": "Egy flexibilis monitorozó rendszert fejlesztettem a termékünkben, ami képes volt baremetal és hálózati statisztikák gyűjtésére, ezen felül biztonsági fejlesztéseken dolgoztam.",
    "work.nokiaSWDeveloperIntern.title": "Software Fejlesztő Gyakornok",
    "work.nokiaSWDeveloperIntern.caption": "Python Django alapú, konfigurációs tool-on dolgoztam, amivel belső termékekhez lehetett egyszerűen konfigurációt gyártani vagy meglévőt módosítani.",
    "work.cadline": "Cadline Kft.",
    "work.cadlineSWDeveloperIntern.title": "Software Fejlesztő Gyakornok",
    "work.cadlineSWDeveloperIntern.caption": "Résztvettem az Archline.XP belsőépítészeti szoftver fejlesztésén, egy falburkoló algoritmuson dolgoztam ami képes véletlen méretű négyszögekkel lefedni egy adott területet.",

    "skills.sectionTitle": "Szakmai ismeretek",
    "skills.python.description": "Sokféle webes keretrendszert használtam, legtöbb tapasztalatomat Django-ban szereztem, azon belül is a DjangoREST-ben, de használtam kisebb projektekre Flask-t és AIOHTTP-t is. Résztvettem egy belső tool tervezésében/fejlesztésében, amit havonta közel 1000 ember használt a világ minden tájáról különböző konfigurációk generálásához, szerkesztéséhez. Ezenkívül van tapasztalatom több millió soros xml fájlok feldolgozásában, YANG adatstruktúrák kezelésében, aszinkron folyamatok implementálásában.",
    "skills.js.description": "Dolgoztam nagyobb kliens oldali webes keretrendszerekben is, volt egy projekt ami kb fél évig futott abban Angular-t használtunk, de az időm nagy részében - közel 2 évben - React-tal foglalkoztam. Szakdolgozatomat is fullstack JavaScriptben írtam (Node.js - React).",
    "skills.linux.description": "Munkában is és otthon is linuxot használok, mint elsőszámú operációs rendszer, már évek óta. A különböző fejlesztéseinket is linux alapú szervereken hosztoljuk, azok fenntartásán is dolgoztam.",
    "skills.docker.description": " ",
    "skills.kubernetes.description": " ",

    "school.gdf.name": "Gábor Dénes Főiskola (Távoktatás), Budapest (Magyarország)",
    "school.itk.name": "Pázmány Péter Katolikus Egyetem - Információs Technológiai Kar, Budapest (Magyarország)",
    "school.wattay.name": "Wattay Középiskola és Szakiskola, Kiskőrös (Magyarország)",
    "school.petofi.name": "Kiskőrösi Petőfi Sándor Evangélikus Óvoda, Általános Iskola, Gimnázium és Kertészeti Szakközépiskola, Kiskőrös (Magyarország)",

    "lang.sectionTitle": "Nyelvi ismeretek",
    "lang.hungarian": "Magyar",
    "lang.hungarian.levelDescription": "anyanyelvi szint",
    "lang.english": "Angol",
    "lang.english.levelDescription": "társalgasi szint, szakmai nyelv",

    "hobby.sectionTitle": "Hobbi, szabadidő",
    "hobby.programing.title": "programozok",
    "hobby.programing.description": "legyen szó 3d-s dolgokról vagy saját játék fejlesztéséről esetleg saját weboldalakról",
    "hobby.cycling.title": "biciklizek, biciklit szerelek",
    "hobby.cycling.description": "aktivan kerékpárral közlekedek a városban, szeretek hosszabb távokat tekerni, építettem át, újjítottam föl számos kerékpárt"
}
